app/views/users/show.html.erb

SELECT "scores".* FROM "scores"  WHERE "scores"."user_id" = $1  [["user_id", 1]]
---
<ul>
  <% @user.scores.each do |score| %>