app/controllers/scores_controller.rb

INSERT INTO "scores" ("composer", "created_at", "music_xml", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["composer", "Zelda"], ["created_at", "2014-07-29 18:33:06.349464"], ["music_xml", "zelda.xml"], ["title", "Zelda"], ["updated_at", "2014-07-29 18:33:06.349464"], ["user_id", 1]]
---
  def create
    require_login
    @score = Score.new(score_params)
    @score.user_id = current_user.id
    if @score.save

SELECT  "scores".* FROM "scores"  WHERE "scores"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    require_login
    gon.scores = Score.find(params[:id])

SELECT  "scores".* FROM "scores"  WHERE "scores"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "scores" WHERE "scores"."id" = $1  [["id", 4]]
---
  def destroy
    require_login
    @score = Score.find(params[:id])
    @score.destroy